perf/scenarios/dictionary.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 30
      arrivalRate: 1
      # 00:30

    - name: Ramp
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
      # 2:30

    - name: Ramp
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Plain
      duration: 60
      arrivalRate: 10
      # 4:30

    - name: Ramp
      duration: 60
      arrivalRate: 10
      rampTo: 15
    - name: Plain
      duration: 60
      arrivalRate: 15
      # 6:30

    - name: Ramp
      duration: 60
      arrivalRate: 15
      rampTo: 50
      # 7:30

  payload:
    path: "../datasets/500_words.csv"
    fields:
      - "words"

scenarios:
  - name: Load and Stress (/dictionary)
    flow:
      - get:
          url: "/dictionary?word={{words}}"