perf/scenarios/dictionary.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 30
      arrivalRate: 5
    - name: Ramp
      duration: 30
      arrivalRate: 10
      rampTo: 50
    - name: Plain
      duration: 60
      arrivalRate: 50

scenarios:
  - name: Load (/dictionary with only 'banana')
    flow:
      - get:
          url: "/dictionary?word=banana"