perf/scenarios/dictionary.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 20
      arrivalRate: 1
    - name: Ramp
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 30
      arrivalRate: 5
    - name: Ramp
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Plain
      duration: 30
      arrivalRate: 10

  payload:
    path: "../datasets/words.csv"
    fields:
      - "words"

scenarios:
  - name: Load and Stress (/dictionary)
    flow:
      - get:
          url: "/dictionary?word={{words}}"