perf/scenarios/load_spaceflight_news.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 30
      arrivalRate: 10
    - name: Ramp
      duration: 30
      arrivalRate: 10
      rampTo: 30
    - name: Plain
      duration: 60
      arrivalRate: 30

scenarios:
  - name: Load (/spaceflight_news)
    flow:
      - get:
          url: "/spaceflight_news"