perf/scenarios/spaceflight_news.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 20
      arrivalRate: 10
    - name: Ramp
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: Load
      duration: 30
      arrivalRate: 50
    - name: Ramp
      duration: 60
      arrivalRate: 50
      rampTo: 100
    - name: Load
      duration: 30
      arrivalRate: 100
    - name: Ramp
      duration: 60
      arrivalRate: 100
      rampTo: 150

scenarios:
  - name: Load (/spaceflight_news)
    flow:
      - get:
          url: "/spaceflight_news"